/*.
逻辑运算符的易错点
2019-11-7
GitHub:https://github.com/iswufe99
测试环境: windows10 , gcc version 8.1.0
*/
/*
知识点：
！ 逻辑非 
&& 逻辑与 //前边的值为假，后边的将不在执行，前为真，执行后
|| 逻辑或 //前边的值为真，后边的将不在执行，前为假，执行后
运算        
！真        假
！假        真
真 && 真    真
真 && 假    假
假 && 真    假
假 && 假    假
真 || 真    真
真 || 假    真
假 || 真    真
假 || 假    假

真 输出1
假 输出0
*/
#include <stdio.h>
#include <stdlib.h>//system使用需要库文件
int main(void)
{
    system("cls");//清屏,为程序需显示做准备
    int i = 10;
    int j = 11;
    int m;
    printf("执行结果:!i = %d， m = %d\n",!i,!m);//不等于0的任何数非运算的结果均为1，m默认赋值为0，非运算结果为1.
/*执行结果:!i = 0 !m = 1*/    
    int s;
    s = (7>5)&&(j=9);//j被重新赋值为9，7>5为真，即1&&9结果仍真，输出1.
    printf("执行结果:s = %d, j = %d\n",s,j);
/*执行结果:s = 1, j = 9 */
    s = (7>5)&&(j==10);//判断j和10不等，整个表达式假 输出0。
    printf("执行结果:m = %d, j = %d\n",s,j);
/*执行结果:s = 0, j = 9 */
    m = (i>j)||(s);//i=10,j=9,s=0,表达式结果为真，m将为1
    printf("执行结果:m = %d, s = %d\n",m,s);
/*执行结果:m = 1, s = 0 */
    if(s && (m+=1))
    {
        printf("s = %d m = %d\n");
    }else
    {
        printf("执行结果:s = %d， m = %d\n",s,m);//s = 0，&&后面的不会被执行，执行此语句，m的仍然为1
    }
    if(s || (m+=1))
    {
        printf("执行结果:s = %d， m = %d\n",s,m);//s = 0,，||后面的被执行,m+=1结果为2，因此整个表达式为真，执行此语句。
    }else
    {
        printf("s = %d m = %d\n",s,m);
    }

    return 0;
}