/*
 算术运算符: + - * / %(取余数)
 /被除数与除数中有一个含小数,结果为浮点数.
 %的符号与被除数一致.
 关系运算符: > >= < <= != ==
 逻辑运算符:!(非) &&(与) ||(或)

 */
#include <stdio.h>
#include <stdlib.h>//system使用需要库文件
int main(void)
{
    system("cls");//清屏,为程序需显示做准备
    printf("*********************************\n");
    printf("%d %d %d %d %d %d %d\n",3/3,3/2,3/2.0,3.0/2,13%3,13%-3,-13%-3);
    printf("*********************************\n");
    return 0;
}
/*
输出结果是:
*********************************
1 1 0 0 1 1 -1
*********************************
*/